import { NavLink } from 'react-router-dom';
import styles from './About.module.css';

const About = () => {
  return (
    <div className={styles.container}>
      <div className={styles.title}>
        <h1>Про нас</h1>
      </div>
      <div className={styles.content}>
        <section className={styles.mainContent}>
          <div className={styles.intro}>
            <p>
              <span className={styles.nameCompany}>Better Call Us</span> — це
              Ваш надійний партнер у світі реклами. Заснована в 2024 році, наша
              компанія спеціалізується на створенні креативних та ефективних
              рекламних рішень для бізнесів усіх розмірів. Наша місія —
              допомогти вашому бренду виділитися та залучити нових клієнтів за
              допомогою інноваційних стратегій та незабутнього дизайну.
            </p>
          </div>
          <div className={styles.philosophy}>
            <h2>Наша філософія</h2>
            <p>
              Ми віримо, що ефективна реклама починається з глибокого розуміння
              потреб наших клієнтів. Ми працюємо пліч-о-пліч з Вами, щоб
              розробити персоналізовані рекламні кампанії, які точно
              відображають суть Вашого бренду.
            </p>
          </div>
          <div className={styles.reasons}>
            <h2>Чому обирають нас</h2>
            <ul>
              <li>
                досвід і професіоналізм: наша команда складається з
                висококваліфікованих професіоналів, які знають, як зробити Вашу
                рекламу ефективною та запам'ятовуваною;
              </li>
              <li>
                індивідуальний підхід: кожен клієнт унікальний, тому ми
                підходимо до кожного проєкту з особливою увагою та креативністю;
              </li>
              <li>
                технології та інновації: ми використовуємо найновіші технології
                та тренди у світі реклами, щоб забезпечити максимальну
                ефективність Ваших рекламних кампаній.
              </li>
            </ul>
          </div>
          <div className={styles.contactUs}>
            {/* <h2>Зв'яжіться з нами</h2> */}
            <p>
              Готові зробити Ваш бренд незабутнім? Зв'яжіться з нами сьогодні, і
              дізнайтеся, як ми можемо допомогти Вашому бізнесу зрости і
              процвітати.
              <span className={styles.nameCompany}> Better Call Us</span> — це
              все, що Вам потрібно для успішної реклами!
            </p>
          </div>
          <NavLink to="/contact">
            <button className={styles.button}>Зв'язатись</button>
          </NavLink>
        </section>
      </div>
    </div>
  );
};

export default About;
